import cv2   #opencv读取图像的方式为BGR
import numpy as np

img=cv2.imread('text1.jpg')       #cv.imread ----读取图片
print(type(img))                  #<class 'numpy.ndarray'>
"""
其输出结果为
三维数组
array([[[246, 246, 246],
        [246, 246, 246],
        [246, 246, 246],
        ...,
        [246, 246, 246],
        [246, 246, 246],
        [246, 246, 246]],

       [[246, 246, 246],
        [246, 246, 246],
        [246, 246, 246],
        ...,
        [246, 246, 246],
        [246, 246, 246],
        [246, 246, 246]],

       [[246, 246, 246],
        [246, 246, 246],
        [246, 246, 246],
        ...,
        [246, 246, 246],
        [246, 246, 246],
        [246, 246, 246]],

       ...,

       [[246, 246, 246],
        [246, 246, 246],
        [246, 246, 246],
        ...,
        [246, 246, 246],
        [246, 246, 246],
        [246, 246, 246]],

       [[246, 246, 246],
        [246, 246, 246],
        [246, 246, 246],
        ...,
        [246, 246, 246],
        [246, 246, 246],
        [246, 246, 246]],

       [[246, 246, 246],
        [246, 246, 246],
        [246, 246, 246],
        ...,
        [246, 246, 246],
        [246, 246, 246],
        [246, 246, 246]]], shape=(856, 1170, 3), dtype=uint8)

"""                         #Numpy数组可被打印   输出结果演示



print(img.shape)                  #图像的形状  (856, 1170, 3)
#图像（Numpy数组）储存   三个值   （高度，  宽度，  通道数）
#通道: B G R



print(img)

cv2.imshow("image",img)
#cv2.imshow("winname",mat)
#必需参数：winname和mat。winname是窗口名称字符串，mat是要显示的图像数据

cv2.waitKey(0)   #delay=0 无限延期直至出现键盘指令
'''
参数名 (delay)	 含义	           适用场景	             返回值说明
0	无限期等待，直到用户按下任意键	查看单张静态图片	按下键的ASCII码，不按键不返回
1	等待约 1毫秒 后刷新	实时视频流（如摄像头）	1毫秒内按键则返回键码，否则返回-1
30	等待约 30毫秒 后刷新	播放视频文件（接近自然帧率）	30毫秒内按键则返回键码，否则返回-1
1000	等待约 1000毫秒（1秒） 后刷新	逐帧浏览视频（慢速查看）	1秒内按键则返回键码，否则返回-1

'''


cv2.imwrite('text out.jpg', img)      #导出图像

